In [1]:
import pandas as pd
import numpy as np

In [2]:
ab={
    "ID":[1,2,3,4,5],
    "Name":["Sager","Sachin","Pooja","Poonam","Seema"],
    "City":["Pune","Mumbai","Satara","Karad","Latur"],
    "Salary":[2000,3000,4000,5000,3000]
}
print(ab)

{'ID': [1, 2, 3, 4, 5], 'Name': ['Sager', 'Sachin', 'Pooja', 'Poonam', 'Seema'], 'City': ['Pune', 'Mumbai', 'Satara', 'Karad', 'Latur'], 'Salary': [2000, 3000, 4000, 5000, 3000]}

In [4]:
data=pd.DataFrame(ab)                           # Creating Dataframe
data.to_csv("Dictionares.csv",index=False)      
data3=pd.read_csv("Dictionares.csv")
data3

   ID    Name    City  Salary
0   1   Sager    Pune    2000
1   2  Sachin  Mumbai    3000
2   3   Pooja  Satara    4000
3   4  Poonam   Karad    5000
4   5   Seema   Latur    3000

In [5]:
data

   ID    Name    City  Salary
0   1   Sager    Pune    2000
1   2  Sachin  Mumbai    3000
2   3   Pooja  Satara    4000
3   4  Poonam   Karad    5000
4   5   Seema   Latur    3000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Name    5 non-null      object
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [7]:
data.describe()

             ID       Salary
count  5.000000     5.000000
mean   3.000000  3400.000000
std    1.581139  1140.175425
min    1.000000  2000.000000
25%    2.000000  3000.000000
50%    3.000000  3000.000000
75%    4.000000  4000.000000
max    5.000000  5000.000000

In [8]:
data.head(2)

   ID    Name    City  Salary
0   1   Sager    Pune    2000
1   2  Sachin  Mumbai    3000

In [9]:
data.tail(2)

   ID    Name   City  Salary
3   4  Poonam  Karad    5000
4   5   Seema  Latur    3000

In [11]:
d=data["ID"].mean()
d

3.0